docs/posts/2025-04-29-rabbi-lustig-pope-francis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Apr 29, 2025 05:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rabbi Lustig on Pope Francis</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Rabbi Lustig on Pope Francis
<br />
<span class="subtitle">Apr 29, 2025 05:51</span>
</h1>
<p>
Rabbi M. Bruce Lustig writing about a conversation with Pope Francis:
</p>

<blockquote>
<p>
It was quite the experience to have a private audience with the pope.
</p>

<p>
I began to tell him: “I am Rabbi Lustig, the child of a Holocaust survivor. I grew up in Nashville, Tennessee.” Francis interrupted and said, “Bruce, may I call you that, I know who you are, you would not be here if I did not know. Now, tell me, what keeps you up at night?”
I said “hate speech,” and for the next hour, we came up with strategies to end hate speech. He listened to me, challenged my views and agreed with me that God spoke the world into being, so speech has the power to create or destroy worlds.
I left our audience with a critical lesson learned at the feet of an important teacher. There is only one voice that matters in the end: your own.
</p>
</blockquote>

<p class="source">
<a href="https://www.washingtonpost.com/opinions/2025/04/28/francis-vance-ordo-amoris-women-priests/?carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F424fdb8%2F6810a3267f8d4e1ed0f71525%2F596a35569bbc0f0e09e8239c%2F31%2F64%2F6810a3267f8d4e1ed0f71525" class="source">The Washington Post</a> (April 28, 2025)
</p>

<div class="tagline" id="orgb43d6e6">
<p>
Tagged:  <a href="../tags/quotes.html">Quotes</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Apr 29, 2025 05:55.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
